load-testing/configs/stress-test.yml
config:
  target: 'http://localhost:8080'
  phases:
    # Extreme load - beyond normal capacity
    - duration: 60
      arrivalRate: 1000
      name: "Extreme Load"
    # Sustained extreme load
    - duration: 120
      arrivalRate: 2000
      name: "Sustained Extreme"
    # Breaking point test
    - duration: 60
      arrivalRate: 5000
      name: "Breaking Point"
  
  defaults:
    headers:
      Content-Type: 'application/json'
      User-Agent: 'Stress-Test/1.0'
  
  plugins:
    metrics-by-endpoint: {}

scenarios:
  - name: "API Stress Test"
    weight: 40
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: [200, 503, 502, 504]  # Accept various responses under stress
      - think: 0.5
      - get:
          url: "/api/v1/streams/list"
          headers:
            X-Admin-Key: "SUPER_SECURE_KEY"
          expect:
            - statusCode: [200, 503, 502, 504]
      - think: 0.5

  - name: "Authentication Stress Test"
    weight: 30
    flow:
      - get:
          url: "/api/v1/auth/google/callback?code=MOCK_AUTH_CODE"
          expect:
            - statusCode: [200, 503, 502, 504]
      - think: 1

  - name: "WebSocket Stress Test"
    weight: 30
    engine: ws
    flow:
      - connect:
          url: "ws://localhost:3001"
          expect:
            - statusCode: [101, 503, 502, 504]
      - think: 2
      - disconnect: